from sklearn.ensemble import RandomForestClassifier
import pickle
import numpy as np 
import pandas as pd

codes = [
    "D50.9 Железодефицитная анемия неуточненная",
    "D51.9 Витамин-B12-дефицитная анемия неуточненная",
    "D52.9 Фолиеводефицитная анемия неуточненная",
    "D53.9 Анемия, связанная с питанием, неуточненная", 
    "D56.9 Талассемия неуточненная", 
    "D57.8 Другие серповидно-клеточные нарушения",
    "D58.9 Наследственная гемолитическая анемия неуточненная",
    "D59.9 Приобретенная гемолитическая анемия неуточненная", 
    "D60.9 Приобретенная чистая красно-клеточная аплазия неуточненная",
    "D61.9 Апластическая анемия неуточненная",
    "D62.0 Острая постгеморрагическая анемия",
    "D63.8 Анемия при других хронических болезнях, классифицированных в других рубриках",
    "D64.4 Врожденная дизэритропоэтическая анемия"
]

with open("model.pkl", "rb") as f:
    model = loaded_model = pickle.load(f)

    cols = ["pol", "ves", "travma", "onko", "infec", "uzi", "nasled",
        "HGB", "erit", "leik", "PLT", "gematok", "MCH", "MCHC", "MCV",
        "pokazatel", "Fe", "OZSS", "Ferrit", "B12", "billirubin", "belok",
        "folievay", "albumin", "mielogramma", "Kumbs"
    ]

    array = pd.DataFrame([
        [0, 0.54, 0, 0, 0, 0, 0, 
        101.00, 2.39, 7.54, 153.71, 31.01, 22.47,	
        170.62,	70.26, 0.67, 5.97,	
        35.30, 3.07, 438.43, 3.10, 46.76, 
        8.43, 18.03, 0, 0], 
    ],columns=cols)

    res = model.predict(array)
    print(codes[res[0]-1])
    